app/controllers/playlists_controller.rb

SELECT "playlists".* FROM "playlists"
---
    def index
        @playlists = Playlist.all

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @playlist = Playlist.find(params[:id])

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
        @playlist = Playlist.find(params[:id])