app/controllers/playlist_songs_controller.rb

SELECT "playlist_songs".* FROM "playlist_songs"
---
    def index
        @playlist_songs = PlaylistSong.all

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "playlist_songs".* FROM "playlist_songs" WHERE "playlist_songs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def show
        @playlist_song = PlaylistSong.find(params[:id])