app/controllers/songs_controller.rb

    def update
        @song = Song.find(params[:id])
        @song.update(song_params)
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "songs" SET "likes" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["likes", nil], ["updated_at", "2021-03-31 20:56:17.757051"], ["id", 1]]